app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---

     <%= f.collection_select(:category_id, Category.all, :id, :name, {prompt: "Choose a category" }) %><br>