app/views/posts/_nav.html.erb

<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"